Repository: tumble-for-kronox/Tumble-Cross-Platform
Catalog: lib/locale/app_*.arb
Languages: fr, vi

# searchBarUnfocusedPlaceholder
source: Search schedules
fr: Chercher son emploi du temps
vi: Tìm lịnh

# searchBarFocusedPlaceholder
source: Code, name, teacher
fr: Code, nom, professeur
vi: Mã, Tên , Giáo viên

# searchPageTitle
source: Search
fr: Recherche
vi: Tìm

# listViewTitle
source: List
fr: Liste
vi: Danh sách

# listViewToTopButton
source: TOP
fr: HAUT
vi: Đỉnh

# weekViewTitle
source: Week
fr: Semaine
vi: Tuần

# calendarViewTitle
source: Calendar
fr: Calendrier
vi: Lịch

# accountPageTitle
source: Account
fr: Compte
vi: Tài khoản

# weekViewNumber
source: w. {weekNumber}
fr: s. {weekNumber}
vi: w. {Xố tuần}

# weekViewTodayLabel
source: Today
fr: Aujourd'hui
vi: Hôm nay

# weekViewNoActivities
source: No scheduled activities
fr: Aucune activité planifiée
vi: Không có viêc ở lịch

# signInButtonTitle
source: Sign in
fr: Connecter
vi: Đăng nhập

# signOutButtonTitle
source: Sign out
fr: Déconnecter
vi: Đăng xuất

# loginPageTitle
source: Sign in to Kronox
fr: Se connecter à Kronox
vi: Đăng nhập ở kronox

# loginPageDescription
source: Sign in to Kronox with your student credentials for {universityName} for the best user experience
fr: Connectez vous à Kronox avec vos identifiants étudiant de {universityName} pour une meilleure expérience
vi: Đăng nhập ở Knrox cùng với điểm của học sinh {universityName} để có đượng trải nghiệm tốt nhất

# loginPageUsernamePlaceholder
source: Username/Email
fr: Nom d'utilisateur/Email
vi: Người Dùng/Email

# loginPagePasswordPlaceholder
source: Password
fr: Mot de passe
vi: Mật khẩu

# loginPageSuccessTitle
source: Signed in to Kronox!
fr: Connecté à Kronox!
vi: Đăng nhập vào Kronox!

# loginPageSuccessDescription
source: You've sucessfully signed into {universityName} via Kronox
fr: Vous avez réussi à vous connecter à {universityName} via Kronox
vi: Đăng nhập vào {universityName} bằng Kronox

# loginEmailValidationError
source: Username/Email cannot be empty
fr: Utilisateur/Email ne peut pas être vide
vi: Người Dùng/Email không được để trống

# loginPasswordValidationError
source: Password cannot be empty
fr: Mot de passe ne peut pas être vide
vi: Mật khẩu không được để trống

# unauthorizedPageDescription
source: Connect your Kronox account by logging in
fr: Connectez votre compte Kronox en vous connectant au service
vi: Kết nối với tài khoản Kronox bằng cách đăng nhập

# authorizedPageHello
source: Hello!
fr: Bonjour!
vi: Xin chào

# authorizedPageUserOptionsTitle
source: User options
fr: Options utilisateur
vi: Người dùng lựa chọn

# authorizedPageAutomaticExamSignup
source: Automatic exam signup
fr: S'inscrire aux examens automatiquement
vi: Kết nối tự động

# authorizedPageExternalLinksTitle
source: External links
fr: Liens externes
vi: Kết nối bên ngoài

# authorizedPagePersonalExternalLink
source: Your {webpageName}
fr: Votre {webpageName}
vi: Của {webpageName}

# authorizedPageExternalLinksKronox
source: Kronox for {universityName}
fr: Kronox pour {universityName}
vi: Kronox cho {universityName}

# userEventsNeedToSignupTitle
source: Need to sign up?
fr: Besoin de vous inscrire?
vi: Cần đăng nhập?

# userEventsAlreadySignedUpTitle
source: Already signed up
fr: Déjâ enregistré
vi: Đang đăng nhập

# userEventsUpcomingTitle
source: Upcoming
fr: À venir
vi: Sắp tới

# userEventsRegisterButton
source: Register
fr: S'inscrire
vi: Đăng ký

# userEventsUnregisterButton
source: Unregister
fr: Se désinscrir
vi: Hủy đăng ký

# userEventsOpenKronoxButton
source: Open Kronox
fr: Ouvrir Kronox
vi: Mở Kronox

# userEventsFailedToLoadExams
source: We couldn't get your exams, try again in a bit.
fr: Nous n'avons pas pu trouver vos examens, réessayez dans quelques instants.
vi: Chúng tôi không thể lấy bài kiểm tra của bạn, hãy thử lại sau một chút.

# userEventsEmpty
source: You have no exams!
fr: Vous n'avez pas d'examens!
vi: Không có bài kiểm tra

# userEventsUnregisterUntil
source: Unregister until
fr: Se désinscrire jusqu'au
vi: Hủy đăng ký đến khi

# userEventsRegisterBefore
source: Register before
fr: S'inscrire avant
vi: Đăng ký trước khi

# settingsTitle
source: SETTINGS
fr: PARAMÈTRES
vi: CÀI ĐẶT

# settingsCommonTitle
source: Common
fr: Commun
vi: Bình thường

# settingsCommonChangeSchoolsTitle
source: Change schools
fr: Changer l'école
vi: Đổi trường

# settingsCommonChangeSchoolsSubtitle
source: Current school {schoolAbbreviation}
fr: École actuelle {schoolAbbreviation}
vi: Trường hiện tại {schoolAbbreviation}

# settingsChooseUniversity
source: Choose your university
fr: Sélectionnez votre université
vi: Chọn trường đại học

# settingsCommonChangeThemeTitle
source: Change theme
fr: Changer thème
vi: Đổi kiểu

# settingsCommonChangeThemeSubtitle
source: Current theme: {themeName}
fr: Thème actuel: {themeName}
vi: Kiểu hiện tại: {themeName}

# settingsScheduleTitle
source: Schedule
fr: Planning
vi: Lịch

# settingsScheduleDefaultScheduleTitle
source: Set shown schedules
fr: Définir planning par défaut
vi: Đặt hiện lịch

# settingsScheduleDefaultScheduleSubtitle
source: Select from your list of bookmarks
fr: Sélectionnez dans votre liste de signets
vi: Chọn trong số thẻ đánh dấu

# settingsScheduleNoBookmarks
source: No bookmarks yet
fr: Aucun signet à ce moment
vi: Không có đánh dấu

# settingsNotificationTitle
source: Notifications
vi: Thông báo

# settingsNotificationClearAllTitle
source: Clear all
fr: Tout supprimer
vi: Xóa tất cả

# settingsNotificationClearAllSubtitle
source: Removes all notifications
fr: Supprime toutes les notifications
vi: Xóa tất cả thông báo

# settingsNotificationOffsetTitle
source: Notification offset
fr: Décomptage de la notification
vi: Đặt báo trước

# settingNotificationOffsetSubtitle
source: Current offset:
fr: Décomptage actuelle:
vi: Báo trước:

# settingsNotificationOffsetMinutes
source: {minutes} minutes
vi: {minutes} Phút

# settingsMiscTitle
source: Miscellaneous
fr: Autre
vi: Những thứ khác

# settingsMiscBugTitle
source: Report a bug
fr: Signaler un problème
vi: Thông báo lỗi

# settingsMiscBugSubtitle
source: Send us a bug report of an issue
fr: Envoyez-nous un rapport du problème
vi: Gửi cho chúng tôi về lỗi của phần mềm

# settingsMiscRateTitle
source: Rate our app
fr: Évaluez notre application
vi: Đánh giá ứng dụng của chúng tôi

# settingsMiscRateSubtitle
source: Rate our app on {storeName}
fr: Évaluez notre application dans le {storeName}
vi: Đánh giá ứng dụng của chúng tôi ở {storeName}

# settingsMiscChangeLanguageTitle
source: Change language
vi: Đổi ngôn ngữ

# settingsMiscChangeLanguageSubtitle
source: Change language in the app
vi: Đổi ngỗn ngữ của phần mềm

# scaffoldMessageCreatedNotificationForCourse
source: Successfully created {eventCount} notifications for {courseName}
fr: {eventCount} notifications pour {courseName} ont été créées
vi: Thành công tạo ra {eventCount} và thông báo cho {courseName}

# scaffoldMessageCreatedNotificationForEvent
source: Sucessfully created notification for {eventName}
fr: Notification pour {eventName} à été créée
vi: Thành công tạo ra thông báo cho {eventName}

# scaffoldMessageCancelledAllSetNotifications
source: Cancelled all notifications
fr: Annuler toutes notifications
vi: Đã hủy tất cả các thông báo

# scaffoldMessageCancelledEventNotification
source: Cancelled notification for {eventName}
fr: Notification pour {eventName} à été annulée
vi: Đã hủy thông báo cho {eventName}

# scaffoldMessageCancelledCourseNotifications
source: Cancelled notifications for {courseName}
fr: Notification pour {courseName} à été annulée
vi: Thông báo bị hủy đối với {courseName}

# scaffoldMessageCancelNotificationsFailed
source: Failed to cancel notifications for {courseOrEventName}
fr: Erreur lors de l'annulation des notifications pour {courseOrEventName}
vi: Không thể hủy thông báo cho {courseOrEventName}

# scaffoldMessageOpenEventOptionsFailed
source: Schedule must be default to access options
fr: Emploi du temps doit être défini en tant que défaut pour cette manipulation
vi: Lịch biểu phải được đặt mặc định để truy cập các tùy chọn

# scaffoldMessageChangeTheme
source: Changed theme to {themeTypeName}
fr: Thème changé à {themeTypeName}
vi: Đã thay đổi chủ đề thành {themeTypeName}

# scaffoldMessageChangedSchool
source: Changed school to {schoolName}
fr: École changé à {schoolName}
vi: Đã đổi trường thành {schoolName}

# scaffoldMessageChangedDefaultView
source: Changed default view to {viewType}
fr: Affichage modifié: {viewType}
vi: Đã thay đổi chế độ xem mặc định thành {viewType}

# scaffoldMessageChangedDefaultSchedule
source: Changed default schedule to {scheduleId}
fr: Emploi du temps par défaut modifié à {scheduleId}
vi: Đã thay đổi lịch biểu mặc định thành {scheduleId}

# scaffoldMessageChangedDefaultNotificationOffset
source: Changed default notification offset to {notificationOffset} before start time
fr: Décomptage changé à {notificationOffset} minutes
vi: Đã thay đổi phần bù thông báo mặc định thành {notificationOffset} trước khi bắt đầu

# scaffoldMessageAddedBookmark
source: Saved {scheduleId} to bookmarks
fr: Emploi du temps {scheduleId} sauvegardé dans le signet
vi: Đã lưu {scheduleId} dấu trang

# scaffoldMessageRemovedBookmark
source: Removed {scheduleId} from bookmarks
fr: Emploi du temps {scheduleId} supprimé du signet
vi: Loại bỏ {scheduleId} từ dấu trang

# scaffoldMessageOpenExternalUrlFailed
source: Could not open {webpageName}
fr: Erreur lors de l'ouverture de {webpageName}
vi: Không thể mở {webpageName}

# scaffoldMessageUpdatedCourseColor
source: Updated course color for {courseName}
fr: Couleur du cours mise à jour pour {courseName}
vi: Đã cập nhật màu khóa học cho {courseName}

# runtimeErrorProgramFetch
source: No program found
fr: Aucun programme trouvé
vi: Không tìm thấy chương trình

# runtimeErrorScheduleFetch
source: No schedule found
fr: Aucun emploi du temps trouvé
vi: Không tìm thấy lịch

# runtimeErrorTimeout
source: Search timed out
fr: Recherche à expiré
vi: Đã hết thời gian tìm kiếm

# runtimeErrorEmptySchedule
source: Schedule is empty
fr: Emploi du temps vide
vi: Lịch biểu trống

# runtimeErrorLogin
source: Failed to sign in
fr: Erreur lors de la connexion
vi: Không đăng nhập được

# runtimeErrorUnknown
source: Something went wrong, please try again
fr: Erreur inconnue, réessayez
vi: Đã xảy ra lỗi. Vui lòng thử lại

# runtimeErrorAuthentication
source: Authentication failed, please try signing in again
fr: Erreur d'authentification, merci de réessayer
vi: Xác thực không thành công, vui lòng thử đăng nhập lại

# runtimeErrorLoginSuccess
source: Successfully signed in
fr: Connexion établie avec succès
vi: Đã đăng nhập thành công

# runtimeErrorNoBookmarks
source: No bookmarked schedules
fr: Aucun empli du temps sauvegardé
vi: Không có lịch dấu trang

# runtimeErrorMissingLocations
source: Unknown location
fr: Location inconnue
vi: Vị trí không xác định

# runtimeErrorMissingTeachers
source: Uknown teachers
fr: Professeur incconu
vi: Giáo viên không xác định

# runtimeErrorNoCachedSchedule
source: No cached schedule found
fr: Aucun emploi du temps dans le cache
vi: Không tìm thấy lịch trong bộ nhớ cache

# runtimeErrorFailedExamSignup
source: Couldn't sign up, try again later or go to kronox
fr: Erreur lors de l'inscription', essayez plus tard ou utilisez Kronox
vi: Không thể đăng ký, hãy thử lại sau hoặc truy cập kronox

# runtimeErrorInvalidInputFields
source: Username and password cannot be empty
fr: Utilisateur ou mot de passe ne peut pas être vide
vi: Tên người dùng và mật khẩu không được để trống

# popUpNotificationPermissionTitle
source: Allow notifications
fr: Autoriser les notifications
vi: Cho phép thông báo

# popUpNotificationPermissionDescription
source: This app would like to send you notifications
fr: Cette application veut vous envoyer des notifications
vi: Ứng dụng này muốn gửi cho bạn thông báo

# popUpExamAutoSignupTitle
source: Automatic exam registration should be used with caution!
fr: La fonction de l'inscription automatique pour les examens doit être utilisée avec caution!
vi: Đăng ký thi tự động nên sử dụng một cách thận trọng!

# popUpExamAutoSignupBody
source: Things can go wrong and so it is still your own responsibility to make sure you are signed up for your exams. If an exam requires you to choose a location you cannot be automatically signed up, similarly you must manually enable support if you need it
fr: Des erreurs peuvent se produire. Vous êtes résponsable de vos inscriptions donc assurez-vous que vous êtes bien inscrit. Si un examen vous oblige à choisir un lieu, vous ne pouvez pas avoir recours à l'inscription automatique. Vous devrez donc vous inscrire par vous même via Kronox.
vi: Mọi thứ có thể xảy ra sai sót và do đó, trách nhiệm của bạn vẫn là đảm bảo rằng bạn đã đăng ký cho các bài thi của mình. Nếu bài kiểm tra có yêu cầu bạn chọn một lớp mà không thể tự động đăng ký (tương tự như vậy) bạn phải bật hỗ trợ nếu cần thiết

# popUpScheduleHelpFirstLine
source: Schedules can be bookmarked with this icon
fr: L'emploi du temps ne peut pas être sauvegardé avec cette icone.
vi: Lịch có thể được đánh dấu bằng biểu tượng này

# popUpScheduleHelpSecondLine
source: It will appear in the top left corner once you've searched for and opened your schedule
fr: Après avoir recherché et ouvert l'emploi du temps, une icone va apparaître en haut à gauche.
vi: Nó sẽ xuất hiện ở góc trên cùng bên trái khi bạn đã tìm và mở lịch của mình

# popUpScheduleIsEmptyTitle
source: This schedule appears to be empty but still in the Kronox database
fr: Cet emploi du temps semble être vide mais a été trouvé dans Kronox.
vi: Lịch này có vẻ trống nhưng vẫn nằm trong bộ liêu nhớ của Kronox

# popUpScheduleIsEmptyBody
source: Kronox stores schedules even if they do not contain any data, so our searches might ocassionally find emtpy schedules
fr: Kronox sauvegarde vos emploi du temps même s'ils ne contiennent pas de données; c'est la raison pour laquelle vous trouverez des emploi du temps vide.
vi: Kronox lưu trữ lịch ngay cả khi chúng không chứa bất kỳ dữ liệu nào, vì vậy, tìm lịch của bạn đôi khi có thể tìm thấy lịch trống

# popUpScheduleFetchError
source: There was an error retrieveing this schedule
fr: Une erreure s'est produite lors de la récuperation de l'emploi du temps.
vi: Đã xảy ra lỗi khi truy xuất lịch biểu này

source: No
fr: Non
vi: Không

source: Yes
fr: Oui
vi: Có

source: Cancel
fr: Annuler
vi: Hủy bỏ

source: Understood
fr: Compris
vi: Hiểu

source: Done
fr: Terminé
vi: Xong

# toSearch
source: Take me to search
fr: Montrez moi la recherche
vi: Đưa tôi đến chỗ tìm kiếm

# tryAgain
source: Please try again
fr: Veuillez réessayer
vi: Thử lại

source: Send
fr: Envoyer
vi: Gửi

source: Unknown
fr: Inconnu
vi: Không biết

# eventOptionsRemoveEventNotification
source: Remove notification for event
fr: Enlever notification pour événement
vi: Xóa thông báo cho sự kiện

# eventOptionsRemoveCourseNotifications
source: Remove all nofitications for course
fr: Enlever toutes notifications pour le cours
vi: Xóa tất cả thông báo cho khóa

# eventOptionsAddEventNotification
source: Set notification for event
fr: Définir notification pour événement
vi: Đặt thông báo cho sự kiện

# eventOptionsAddCourseNotifications
source: Set notifications for course
fr: Définir notifications pour cours
vi: Đặt thông báo cho sự khóa

# eventOptionsChangeCourseColor
source: Change course color
fr: Changer couleur du cours
vi: Thay đổi màu cho khóa

# eventOptionsColorPickerTitle
source: Pick a color
fr: Choisir une couleur
vi: Chọn màu

# detailsTitle
source: DETAILS
vi: Chi tiết

# detailsDate
source: Date
vi: Ngày

# detailsTime
source: Time
fr: Temps
vi: Giờ

# detailsRegisterBefore
source: Register before
fr: S'inscrire avant
vi: Đăng ký trước

# detailsType
source: Type
fr: Genre
vi: Kiểu

# detailsSupport
source: Support
vi: Hỗ trợ

# detailsSupportAvailable
source: Support available, enable on Kronox
fr: Support disponible, veuillez faire la demande via Kronox
vi: Có hỗ trợ, kích hoạt trên Kronox

# detailsSupportUnavailable
source: No support available
fr: Aucun support disponible
vi: Không có hỗ trợ

# detailsAnonymousCode
source: Anonymous Code
fr: Code anonyme
vi: Mã ẩn danh

# detailsRegistrationOpens
source: Registration opens
fr: Inscription ouvre
vi: Đăng ký đang mở

# detailsLocation
source: Location
vi: Vị trí

# detailsCourse
source: Course
fr: Cours
vi: Khóa

# detailsTeachers
source: Teachers
fr: Professeurs
vi: Giáo viên

# supportModalTitle
source: SUPPORT
vi: Giúp

# supportModalSubjectTooShort
source: Subject must be greater than 5 characters
fr: Sujet doit contenir plus que 5 caractères
vi: Chủ đề phải lớn hơn 5 ký tự

# supportModalIssueTypeLabel
source: Type of issue
fr: Genre du problème
vi: Loại vấn đề

# supportModalIssueSummaryHelper
source: Summarize your issue in a short title
fr: Résumez votre problème en une phrase courte
vi: Tóm tắt vấn đề của bạn trong tiêu đề

# supportModalBodyTooShort
source: Body must be greater than 5 characters
fr: Message doit contenir plus que 5 caractères
vi: Nội dung phải lớn hơn 5 ký tự

# supportModalExplainIssueLabel
source: Explain your issue
fr: Veuillez expliquez votre problème
vi: Giải thích vấn đề của bạn

# supportModalExplainIssueHelper
source: Explain your issue in more detail, so we can help
fr: Veuillez expliquez votre problème avec plus de détails pour que nous pouissons vous aider
vi: Giải thích vấn đề của bạn chi tiết hơn để chúng tôi có thể trợ giúp

# supportModalSendSuccess
source: Bug report sent!
fr: Rapport du problème envoyé!
vi: Đã gửi báo cáo lỗi!

# supportModalSendFail
source: There was an error with your request! Please try again at a later time
fr: Il y a eu une erreur avec votre demande! Veuillez réessayer ultérieurement
vi: Đã xảy ra lỗi với yêu cầu của bạn! Vui lòng thử lại sau

# contributorsModalTitle
source: CONTRIBUTORS
vi: ĐÓNG GÓP

# contributorsModalDevelopment
source: Development
vi: Chế tạo

# contributorsModalDesign
source: Design
vi: Thiết kế

# contributorsModalTranslation
source: Translation
vi: Biên dịch

# contributorsModalSpecialThanks
source: Special thanks
vi: Cảm ơn

# settingsNotificationOffsetHours
source: {hours,plural, =1{{hours} hour} other{{hours} hours}}
fr: {hours,plural, =1{{hours} heure} other{{hours} heures}}

source: Ok
fr: D'accord
